Tekla.Structures.Model.RebarSpacing.MaxRebarSpacingZones
The maximum rebar spacing zones.

Tekla.Structures.Model.RebarSpacing.startOffSet
The start offset

Tekla.Structures.Model.RebarSpacing.endOffSet
The end offset

Tekla.Structures.Model.RebarSpacing.startOffsetType
The startOffsetType

Tekla.Structures.Model.RebarSpacing.endOffsetType
The endOffsetType

Tekla.Structures.Model.RebarSpacing.startOffsetIsAutomatic
The startOffsetIsAutomatic

Tekla.Structures.Model.RebarSpacing.endOffsetIsAutomatic
The endOffsetIsAutomatic

Tekla.Structures.Model.RebarSpacing.Zones
Gets or sets the spacing zones.

Tekla.Structures.Model.RebarSpacing.StartOffset
Gets or sets the proposed offset to the first reinforcing bar from the start of the Tekla.Structures.Model.RebarGuideline.
Throws System.InvalidOperationException: Thrown if the user attempts to modify the guideline spacing, when the
inherit from primary property has been set to true

Tekla.Structures.Model.RebarSpacing.EndOffset
Gets or sets the proposed offset to the last reinforcing bar from the end of the Tekla.Structures.Model.RebarGuideline.
Throws System.InvalidOperationException: Thrown if the user attempts to modify the guideline spacing, when
the inherit from primary property has been set to true

Tekla.Structures.Model.RebarSpacing.StartOffsetType
Gets or sets a value indicating whether the start offset is exact or minimum.
If the start offset is minimum the spacing algorithm may determine a larger offset.
Throws System.InvalidOperationException: Thrown if the user attempts to modify the guideline spacing,
when the inherit from primary property has been set to true

Tekla.Structures.Model.RebarSpacing.EndOffsetType
Gets or sets a value indicating whether the end offset is exact or minimum.
If the end offset is minimum the spacing algorithm may determine a larger offset.
Throws System.InvalidOperationException: Thrown if the user attempts to modify the guideline spacing,
when the inherit from primary property has been set to true

Tekla.Structures.Model.RebarSpacing.StartOffsetIsAutomatic
Gets or sets a value indicating whether the start offset is automatic.
When automatic the proposed start offset is calculated to be the concrete cover thickness plus half the reinforcing bar diameter.
Throws System.InvalidOperationException: Thrown if the user attempts to modify the guideline spacing,
when the inherit from primary property has been set to true

Tekla.Structures.Model.RebarSpacing.EndOffsetIsAutomatic
Gets or sets a value indicating whether the end offset is automatic.
When automatic the proposed end offset is calculated to be the concrete cover thickness plus half the reinforcing bar diameter.
Throws System.InvalidOperationException: Thrown if the user attempts to modify the guideline spacing,
when the inherit from primary property has been set to true

Tekla.Structures.Model.RebarSpacing.ToStructs(Tekla.Structures.ModelInternal.dotRebarSpacing_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})
The to structs method.
dotSpacing: The dot rebar spacing struct.
spacingZoneData: The dot zones.

Tekla.Structures.Model.RebarSpacing.FromStructs(Tekla.Structures.ModelInternal.dotRebarSpacing_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})
The from structs method.
dotSpacing: The dot rebar spacing struct.
spacingZoneData: The dot zones.

Tekla.Structures.Model.RebarSpacing.CheckInheritFromPrimary
Issues message. Exception thrown if the user attempts to modify the guideline spacing, when the
inherit from primary property has been set to true